// log.js　制作ログ

export const logs = [
  {
    date: "2026/02/07",
    log: [
      "index.htmlをポートフォリオの入口としてわかりやすくしたいと考えた",
      "Figmaでindex.htmlのフレームを作ってみた",
      "メニュー一覧とクリックで開くことでページが長くなるのを防ごうと考えた",
      "更新状況を表示したい",
    ],
  },
  {
    date: "2026/02/08",
    log: [
      "レシピページのrecipes.htmlのJavaScriptの疑問（オブジェクトの中の配列の中のオブジェクトをhtmlで表示させる）をchagGPTで解決できた",
      "レシピページと同じ仕組みで制作ログを作ることを考えた",
    ],
  },
  {
    date: "2026/02/09",
    log: [
      "参考とするポートフォリオデザインをpinterestでピックアップした",
      "制作ログ用のデータをcreativeLog.jsファイルを作成し、準備した",
    ],
  },
];
